export const REGEXP = {

  implementerName: /^(?![-_ ])[a-zA-Zа-яА-Я0-9'.,]*(?:(?:[ -](?! ))|(?:[_](?!_)))*[a-zA-Zа-яА-Я0-9'.,]+(?![-_ ])$/,
  phone: /^(?:\+7|8)?(?:\d{10})$/,
  email:
    /^([0-9a-zA-Zа-яА-ЯёЁ]+([^<>()[\]\\.,;:\s@"]*(\.[^<>()[\]\\.,;:\s@"]+)*)|(".+")[0-9a-zA-Zа-яА-ЯёЁ]+)@((\[[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}])|(([a-zA-Z0-9]+\.)+[a-zA-Z]{2,}))$/,
  contactPersonName: /^[\sа-яА-ЯёЁ'-]{2,50}$/,
  contactPersonPost: /^[\sa-zA-Zа-яА-Я 0-9.,;:'"!?\-—–‒()\[\]{}…@#%^*+\/\\<>№`~|=$]{2,50}$/,
  serviceNameFromArray: /^[\sa-zA-Zа-яА-Я0-9.,;:'"!?\-—–‒()\[\]{}…@#%^*+\/\\<>№`~|=$!@#$%^&*]{4,50}$/,
  textField: /^[a-zA-Zа-яА-ЯёЁ0-9!@#$%^&*€£¥½[\]{}()\-_+=;:",./?\\|`~\s]+$/,
  url: /^(https?:\/\/)?([a-zA-Z0-9-]+\.)+[a-zA-Z]{2,}(\/[^\s]*)?$/,
  viber: /^viber:\/\/chat\?number=\d+$/,
  vkontakte: /^https?:\/\/(vk\.com|m\.vk\.com)\/(\w+|id\d+)$/,
  telegram: /^https?:\/\/t\.me\/(\w+)$/,
  whatsapp: /^https:\/\/wa\.me\/\d+$/,
  number: /^[1-9]\d*$/,
  serviceName: /^[a-zA-Zа-яА-ЯёЁ0-9 ,.'"-]+$/,
};
